src/cf/DocumentJournals/ПередачаМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DocumentJournal>
		<Properties>
			<Name>ПередачаМатериалов</Name>
			<RegisteredDocuments>
				<xr:Item>Document.СписаниеТоваров</xr:Item>
				<xr:Item>Document.ТребованиеНакладная</xr:Item>
				<xr:Item>Document.ПеремещениеТоваров</xr:Item>
			</RegisteredDocuments>
		</Properties>
		<ChildObjects>
			<Column>
				<Properties>
					<Name>Организация</Name>
					<References>
						<xr:Item>Document.СписаниеТоваров.Attribute.Организация</xr:Item>
						<xr:Item>Document.ТребованиеНакладная.Attribute.Организация</xr:Item>
						<xr:Item>Document.ПеремещениеТоваров.Attribute.Организация</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Комментарий</Name>
					<References>
						<xr:Item>Document.СписаниеТоваров.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ТребованиеНакладная.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ПеремещениеТоваров.Attribute.Комментарий</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Ответственный</Name>
					<References>
						<xr:Item>Document.СписаниеТоваров.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ТребованиеНакладная.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ПеремещениеТоваров.Attribute.Ответственный</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<References>
						<xr:Item>Document.СписаниеТоваров.Attribute.РучнаяКорректировка</xr:Item>
						<xr:Item>Document.ТребованиеНакладная.Attribute.РучнаяКорректировка</xr:Item>
						<xr:Item>Document.ПеремещениеТоваров.Attribute.РучнаяКорректировка</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<References>
						<xr:Item>Document.СписаниеТоваров.Attribute.ПодразделениеОрганизации</xr:Item>
						<xr:Item>Document.ТребованиеНакладная.Attribute.ПодразделениеОрганизации</xr:Item>
						<xr:Item>Document.ПеремещениеТоваров.Attribute.ПодразделениеОтправитель</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Сотрудник</Name>
					<References>
						<xr:Item>Document.СписаниеТоваров.Attribute.Сотрудник</xr:Item>
						<xr:Item>Document.ТребованиеНакладная.Attribute.Сотрудник</xr:Item>
						<xr:Item>Document.ПеремещениеТоваров.Attribute.СотрудникОтправитель</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ВидОперации</Name>
					<References>
						<xr:Item>Document.СписаниеТоваров.Attribute.ВидОперации</xr:Item>
						<xr:Item>Document.ТребованиеНакладная.Attribute.ВидОперации</xr:Item>
						<xr:Item>Document.ПеремещениеТоваров.Attribute.ВидОперации</xr:Item>
					</References>
				</Properties>
			</Column>
		</ChildObjects>
	</DocumentJournal>
</MetaDataObject>

src/cf/Enums/ВидыОперацийРасходМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыОперацийРасходМатериалов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИспользованиеМатериалов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратнаяТара</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыОперацийСписаниеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыОперацийСписаниеТоваров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СписаниеСоСклада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеССотрудника</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыОперацийПеремещениеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПеремещениеТоваров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПередачаМеждуСкладами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаМеждуСотрудниками</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/DocumentJournals/ПередачаМатериалов/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ГруппаГлобальныеКоманды;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если Параметры.Свойство("Заголовок") Тогда
		Заголовок = Параметры.Заголовок;
		АвтоЗаголовок = Ложь;
	КонецЕсли;
	
	ОбщегоНазначенияБПВызовСервера.УстановитьОтборПоОсновнойОрганизации(ЭтаФорма);
	
	ТарификацияБП.РазместитьИнформациюОбОграниченииПоКоличествуОбъектов(ЭтотОбъект);
	
	АдресХранилищаНастройкиДинСпискаДляРеестра = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	
	ПомеченныеНаУдалениеСервер.СкрытьПомеченныеНаУдаление(ЭтотОбъект);
	
	Если Параметры.ФормаОткрытаИзКарточкиСотрудника Тогда
		Элементы.ГруппаОтборПоСотруднику.Видимость = Ложь;
		Элементы.Сотрудник.Видимость               = Ложь;
	КонецЕсли;
	
	УстановитьОтборСписка();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеОсновнойОрганизации" Тогда
		
		ОбщегоНазначенияБПКлиент.ИзменитьОтборПоОсновнойОрганизации(Список, ,Параметр);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Передача(Команда)
	
	СтруктураПараметров = ПолучитьПараметрыФормыДокумента();
	СтруктураПараметров.ЗначенияЗаполнения.Вставить("ВидОперации",
		ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходМатериалов.ПередачаСотруднику"));
	ОткрытьФорму("Документ.ТребованиеНакладная.ФормаОбъекта", СтруктураПараметров, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Списание(Команда)
	
	СтруктураПараметров = ПолучитьПараметрыФормыДокумента();
	СтруктураПараметров.ЗначенияЗаполнения.Вставить("ВидОперации",
		ПредопределенноеЗначение("Перечисление.ВидыОперацийСписаниеТоваров.СписаниеССотрудника"));
	ОткрытьФорму("Документ.СписаниеТоваров.ФормаОбъекта", СтруктураПараметров, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Перемещение(Команда)
	
	СтруктураПараметров = ПолучитьПараметрыФормыДокумента();
	СтруктураПараметров.ЗначенияЗаполнения.Вставить("ВидОперации",
		ПредопределенноеЗначение("Перечисление.ВидыОперацийПеремещениеТоваров.ПередачаМеждуСотрудниками"));
	ОткрытьФорму("Документ.ПеремещениеТоваров.ФормаОбъекта", СтруктураПараметров, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыВыданныеСотрудникам(Команда)
	
	Вариант = Новый Структура;
	Вариант.Вставить("ИмяОтчета",    "МатериалыВыданныеСотрудникам");
	Вариант.Вставить("КлючВарианта", "МатериалыВыданныеСотрудникам");
	
	БухгалтерскиеОтчетыКлиент.ОткрытьВариантОтчета(Вариант);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	
	ПомеченныеНаУдалениеКлиент.ПриИзмененииСписка(ЭтотОбъект, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура СписокПередЗагрузкойПользовательскихНастроекНаСервере(Элемент, Настройки)
	
	ОбщегоНазначенияБП.ВосстановитьОтборСписка(Список, Настройки, "Организация");
	
	ОтборыСписков.СброситьИспользованиеПользовательскихОтборовВНастройке(Настройки);
	
	ПомеченныеНаУдалениеСервер.УдалитьОтборПометкаУдаления(Настройки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСотрудникИспользованиеПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.УстановитьБыстрыйОтбор(ЭтотОбъект, "Сотрудник");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСотрудникПриИзменении(Элемент)
	
	ОтборСотрудникИспользование = ЗначениеЗаполнено(ОтборСотрудник);
	ОтборыСписковКлиентСервер.УстановитьБыстрыйОтбор(ЭтотОбъект, "Сотрудник");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункцииБСП

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	Если УправлениеПечатьюБПКлиентСервер.ЭтоИмяКомандыРеестрДокументов(Команда.Имя) Тогда
		НастройкиДинамическогоСписка();
	КонецЕсли;
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастройкиДинамическогоСписка()
	
	Отчеты.РеестрДокументов.НастройкиДинамическогоСписка(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьПараметрыФормыДокумента()
		
	СтруктураПараметров = Новый Структура;
	ЗначенияЗаполнения = ОбщегоНазначенияБПВызовСервера.ЗначенияЗаполненияДинамическогоСписка(Список.КомпоновщикНастроек);	
	СтруктураПараметров.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	Возврат СтруктураПараметров;
	
КонецФункции

&НаСервере
Процедура УстановитьОтборСписка()
	
	МассивВидовОпераций = Новый Массив;
	МассивВидовОпераций.Добавить(Перечисления.ВидыОперацийРасходМатериалов.ПередачаСотруднику);
	МассивВидовОпераций.Добавить(Перечисления.ВидыОперацийСписаниеТоваров.СписаниеССотрудника);
	МассивВидовОпераций.Добавить(Перечисления.ВидыОперацийПеремещениеТоваров.ПередачаМеждуСотрудниками);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
		"ВидОперации",
		МассивВидовОпераций,
		ВидСравненияКомпоновкиДанных.ВСписке,
		,
		Истина);
	
КонецПроцедуры

#КонецОбласти
